raspberrypi/rp2040-expander/host/rp2040exp.c
/**
 * Copyright (c) 2023 Raspberry Pi Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <rp2040exp_dap.h>
#include <rp2040exp.h>
#include <rp2040_includes.h>
#include <rp2040exp_port_api.h>

#define DAP_BLOCK_XFER_MAX_WORD_LENGTH  256

#define RESET_ESCAPE_COUNT              10
#define ADC_ESCAPE_COUNT                10

#define ROSC_MAX_FREQ_KHZ               125000ul  // could probably be more

static const uart_hw_t *uart_addr[NUM_UART] = { uart0_hw, uart1_hw };


// struct for ROSC frequency measurement
typedef struct {
    uint64_t time_us;
    uint64_t tick_count;
} rosc_time_n_count_t;

// both vital:
static rosc_time_n_count_t snapshot_rosc_time_n_count = { 0 };
static uint32_t system_clock_frequency_khz = 0;


/*! \brief No-op function for the body of tight loops
 *
 * No-op function intended to be called by any tight hardware polling loop.
 * Using this ubiquitously makes it much easier to find tight loops but
 * also allows de/re-scheduling and/or debugging opportunities.
 */
static void rpexp_tight_loop_contents(void) {}


static rpexp_err_t reset_blocks(uint32_t mask) {

    return rpexp_hw_set_bits(_reg(resets_hw->reset), mask);
}


static rpexp_err_t unreset_blocks(uint32_t mask) {

    return rpexp_hw_clear_bits(_reg(resets_hw->reset), mask);
}


static rpexp_err_t unreset_blocks_wait(uint32_t mask) {

    rpexp_err_t rpexp_err = unreset_blocks(mask);

    for (uint32_t escape = 0; rpexp_err == RPEXP_OK; escape++) {

        uint32_t reset_done;

        rpexp_err = rpexp_read32(_reg(resets_hw->reset_done), &reset_done);

        if (rpexp_err == RPEXP_OK && (reset_done & mask)) {
            break;
        }
        if (escape > RESET_ESCAPE_COUNT) {
            rpexp_err = RPEXP_ERR_RESET_TIMEOUT;
        }
    }

    return rpexp_err;
}


static rpexp_err_t peripheral_enable(bool enable, uint32_t mask) {

    if (enable) {
        return unreset_blocks_wait(mask);
    } else {
        return reset_blocks(mask);
    }
}


static rpexp_err_t set_gpio_function(uint32_t gpio, enum gpio_function new_func) {

    rpexp_err_t rpexp_err = RPEXP_OK;
    uint32_t current_func;

    if (new_func != GPIO_FUNC_NULL) {
        // Assigning a new function: First check if the GPIO is free
        rpexp_err = rpexp_read32(_reg(iobank0_hw->io[(gpio)].ctrl), &current_func);

        if (rpexp_err == RPEXP_OK) {
            if (current_func != GPIO_FUNC_NULL) {
                rpexp_err = RPEXP_ERR_IN_USE;
            }
        }
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(iobank0_hw->io[(gpio)].ctrl), new_func);
    }

    return rpexp_err;
}


static rpexp_err_t _clock_gpio_init_int_frac(uint32_t gpio, rpexp_clkout_t clk_src, uint32_t div_int, uint8_t div_frac) {

    uint32_t gpclk;

    if      (gpio == 21) gpclk = clk_gpout0;
    else if (gpio == 23) gpclk = clk_gpout1;
    else if (gpio == 24) gpclk = clk_gpout2;
    else if (gpio == 25) gpclk = clk_gpout3;
    else {
        return RPEXP_ERR_API_ARG;
    }

    // Set up the gpclk generator
    rpexp_err_t rpexp_err = rpexp_write32(_reg(clocks_hw->clk[(gpclk)].ctrl),
        (clk_src << CLOCKS_CLK_GPOUT0_CTRL_AUXSRC_LSB) | CLOCKS_CLK_GPOUT0_CTRL_ENABLE_BITS);

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(clocks_hw->clk[(gpclk)].div),
            (div_int << CLOCKS_CLK_GPOUT0_DIV_INT_LSB) | div_frac);
    }

    // Set the gpio pin to gpclock function
    if (rpexp_err == RPEXP_OK) {
        rpexp_err = set_gpio_function(gpio, GPIO_FUNC_GPCK);
    }

    return rpexp_err;
}


static rpexp_err_t set_gpio_hi_function(uint32_t higpio, enum gpio_function new_func) {

    if (higpio >= NUM_QSPI_GPIOS) {
        return RPEXP_ERR_API_ARG;
    }

    rpexp_err_t rpexp_err = RPEXP_OK;
    uint32_t current_func;

    if (new_func != GPIO_FUNC_NULL) {
        // Assigning a new function: First check if the GPIO is free
        rpexp_err = rpexp_read32(_reg(ioqspi_hw->io[(higpio)].ctrl), &current_func);

        if (rpexp_err == RPEXP_OK) {
            if (current_func != GPIO_FUNC_NULL) {
                rpexp_err = RPEXP_ERR_IN_USE;
            }
        }
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(ioqspi_hw->io[(higpio)].ctrl), new_func);
    }

    return rpexp_err;
}


static rpexp_err_t peripheral_clock_init(bool enable) {

    rpexp_err_t rpexp_err = rpexp_hw_clear_bits(_reg(clocks_hw->clk[clk_peri].ctrl), CLOCKS_CLK_PERI_CTRL_ENABLE_BITS);

    if (enable) {
        if (rpexp_err == RPEXP_OK) {
            rpexp_err = rpexp_write32(_reg(clocks_hw->clk[clk_peri].ctrl), // select source
            (CLOCKS_CLK_PERI_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH << CLOCKS_CLK_PERI_CTRL_AUXSRC_LSB));
        }
        if (rpexp_err == RPEXP_OK) {
            rpexp_err = rpexp_write32(_reg(clocks_hw->clk[clk_peri].div), 0x100);  // divide by 1.0
        }
        if (rpexp_err == RPEXP_OK) {
            rpexp_err = rpexp_hw_set_bits(_reg(clocks_hw->clk[clk_peri].ctrl), CLOCKS_CLK_PERI_CTRL_ENABLE_BITS);
        }
    }

    return rpexp_err;
}


static rpexp_err_t adc_clock_init(bool enable) {

    rpexp_err_t rpexp_err = rpexp_hw_clear_bits(_reg(clocks_hw->clk[clk_adc].ctrl), CLOCKS_CLK_ADC_CTRL_ENABLE_BITS);

    if (enable) {
        if (rpexp_err == RPEXP_OK) {
            rpexp_err = rpexp_write32(_reg(clocks_hw->clk[clk_adc].ctrl), // select source
            (CLOCKS_CLK_ADC_CTRL_AUXSRC_VALUE_ROSC_CLKSRC_PH << CLOCKS_CLK_ADC_CTRL_AUXSRC_LSB));
        }
        if (rpexp_err == RPEXP_OK) {
            rpexp_err = rpexp_write32(_reg(clocks_hw->clk[clk_adc].div), 0x100);  // divide by 1.0
        }
        if (rpexp_err == RPEXP_OK) {
            rpexp_err = rpexp_hw_set_bits(_reg(clocks_hw->clk[clk_adc].ctrl), CLOCKS_CLK_ADC_CTRL_ENABLE_BITS);
        }
    }

    return rpexp_err;
}


static rpexp_err_t timer_enable(void) {

    rpexp_err_t rpexp_err = peripheral_enable(true, RESETS_RESET_TIMER_BITS);

    if (rpexp_err == RPEXP_OK) {
        // The expander is accessed using DAP/SWD: The timers will freeze unless we clear these
        rpexp_err = rpexp_write32(_reg(timer_hw->dbgpause), 0);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(watchdog_hw->tick),
            (TICK_GENERATOR_CYCLES | WATCHDOG_TICK_ENABLE_BITS));
    }

    return rpexp_err;
}


static rpexp_err_t get_timespec_and_tickcount(rosc_time_n_count_t *tm_tk) {

    tm_tk->time_us = port_get_time_us_64();
    return rpexp_time_get_ticks64(&tm_tk->tick_count);
}


static rpexp_err_t initial_clock_set(void) {

    // Set the ROSC range, afirm enable value (overrite reset default)
    rpexp_err_t rpexp_err = rpexp_write_hw_mask(_reg(rosc_hw->ctrl),
                                            ((ROSC_CTRL_ENABLE_VALUE_ENABLE << ROSC_CTRL_ENABLE_LSB) |
                                             (ROSC_CTRL_FREQ_RANGE_VALUE_LOW << ROSC_CTRL_FREQ_RANGE_LSB)),
                                             (ROSC_CTRL_ENABLE_BITS | ROSC_CTRL_FREQ_RANGE_BITS));

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = timer_enable();
    }

    if (rpexp_err == RPEXP_OK) {
        // start timing for ROSC frequency measurement
        rpexp_err = get_timespec_and_tickcount(&snapshot_rosc_time_n_count);
    }

    // FIXME TODO HERE Work In Progress

    return rpexp_err;
}


static rpexp_err_t chip_init(void) {

    rpexp_err_t rpexp_err;

    rpexp_err = dap_reset_chip_halt_cpus();

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = dap_initial_chip_config();
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = initial_clock_set();
    }

    return rpexp_err;
}


