raspberrypi/rp2040-expander/host/rp2040exp.c
static rpexp_err_t set_gpio_input_enabled(uint32_t gpio, bool enable) {

    if (enable) {
        return rpexp_hw_set_bits(_reg(padsbank0_hw->io[gpio]), PADS_BANK0_GPIO0_IE_BITS);
    } else {
        return rpexp_hw_clear_bits(_reg(padsbank0_hw->io[gpio]), PADS_BANK0_GPIO0_IE_BITS);
    }
}


static rpexp_err_t rosc_frequency_trim_up(uint32_t target_rosc_clock_khz,  uint32_t *measured_rosc_clock_khz) {

    uint32_t freq_bits, last_bits_setting;
    uint32_t freq_delta, last_delta;

    // Firstly, trim ROSC fully _down_ in frequency
    rpexp_err_t rpexp_err = rpexp_rosc_zero_all_freq_ab_bits();

    freq_bits = last_bits_setting = 0;

    while (rpexp_err == RPEXP_OK) {

        rpexp_err = rpexp_rosc_measure_clock_freq_khz(measured_rosc_clock_khz, MIN_ROSC_FREQ_SAMPLE_TIME_US);

        if (rpexp_err == RPEXP_OK) {
            if (*measured_rosc_clock_khz > target_rosc_clock_khz) {
                freq_delta = *measured_rosc_clock_khz - target_rosc_clock_khz;
            } else {
                freq_delta = target_rosc_clock_khz - *measured_rosc_clock_khz;
            }

            if (freq_bits && freq_delta > last_delta) {
                // relies on monotonicity of settings
                break;
            }

            last_delta = freq_delta;
            last_bits_setting = freq_bits;

            freq_bits = rpexp_rosc_inc_freq_ab_bits(freq_bits);
            rpexp_err = rpexp_rosc_set_freq_ab_bits(freq_bits);
        }
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_rosc_set_freq_ab_bits(last_bits_setting);
    }

    if (rpexp_err == RPEXP_OK) {
        // update for best accuracy
        rpexp_err = rpexp_rosc_measure_clock_freq_khz(measured_rosc_clock_khz, MIN_ROSC_FREQ_SAMPLE_TIME_US);
    }

    return rpexp_err;
}


static rpexp_err_t common_rosc_set_freq_ab_bits(uint32_t freq_bits32) {

    rpexp_err_t rpexp_err = rpexp_write32(_reg(rosc_hw->freqa), (ROSC_FREQA_PASSWD_VALUE_PASS << ROSC_FREQA_PASSWD_LSB) | (freq_bits32 & 0xfffful));

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(rosc_hw->freqb), (ROSC_FREQB_PASSWD_VALUE_PASS << ROSC_FREQB_PASSWD_LSB) | (freq_bits32 >> 16ul));
    }

    return RPEXP_OK;
}


static rpexp_err_t uart_set_baudrate(uart_chan_t uart, uint32_t req_baudrate, uint32_t *pactual_baudrate) {

    if (!pactual_baudrate) {
        return RPEXP_ERR_API_ARG;
    }

    if (!system_clock_frequency_khz) {
        return RPEXP_ERR_CLOCK_FREQ_UNKNOWN;
    }

    uint32_t system_clock_frequency_hz = system_clock_frequency_khz * 1000ul;

    uint32_t baud_rate_div = (8ul * system_clock_frequency_hz / req_baudrate);
    uint32_t baud_ibrd = baud_rate_div >> 7;
    uint32_t baud_fbrd;

    if (baud_ibrd == 0) {
        baud_ibrd = 1;
        baud_fbrd = 0;
    } else if (baud_ibrd >= 65535) {
        baud_ibrd = 65535;
        baud_fbrd = 0;
    }  else {
        baud_fbrd = ((baud_rate_div & 0x7f) + 1) / 2;
    }

    // Load PL011's baud divisor registers
    rpexp_err_t rpexp_err = rpexp_write32(_reg(uart_addr[uart]->ibrd), baud_ibrd);

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(uart_addr[uart]->fbrd), baud_fbrd);
    }

    // PL011 needs a (dummy) line control register write to latch in the
    // divisors. We don't want to actually change LCR contents here.
    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_hw_set_bits(_reg(uart_addr[uart]->lcr_h), 0);
    }

    if (rpexp_err == RPEXP_OK) {
        *pactual_baudrate = (4 * system_clock_frequency_hz) / (64 * baud_ibrd + baud_fbrd);
    }

    return rpexp_err;
}


static rpexp_err_t uart_set_format(uart_chan_t uart, uint32_t data_bits, uint32_t stop_bits, uart_parity_type_t parity) {

    if (uart >= NUM_UART) {
        return RPEXP_ERR_API_ARG;
    }
    if (data_bits < 5 || data_bits > 8) {
        return RPEXP_ERR_API_ARG;
    }
    if (stop_bits < 1 || stop_bits > 2) {
        return RPEXP_ERR_API_ARG;
    }
    if (parity > UART_ODD_PARITY) {
        return RPEXP_ERR_API_ARG;
    }

    // set the above parameters and also enable the FIFOs
    return rpexp_write_hw_mask(_reg(uart_addr[uart]->lcr_h),
                  (((data_bits - 5u) << UART_UARTLCR_H_WLEN_LSB) |
                   ((stop_bits - 1u) << UART_UARTLCR_H_STP2_LSB) |
                   (bool_to_bit(parity != UART_NO_PARITY) << UART_UARTLCR_H_PEN_LSB) |
                   (bool_to_bit(parity == UART_EVEN_PARITY) << UART_UARTLCR_H_EPS_LSB) |
                    UART_UARTLCR_H_FEN_BITS),
                  (UART_UARTLCR_H_WLEN_BITS |
                   UART_UARTLCR_H_STP2_BITS |
                   UART_UARTLCR_H_PEN_BITS |
                   UART_UARTLCR_H_EPS_BITS |
                   UART_UARTLCR_H_FEN_BITS));
}


static rpexp_err_t uart_set_hw_flow(uart_chan_t uart, bool cts, bool rts) {

    if (uart >= NUM_UART) {
        return RPEXP_ERR_API_ARG;
    }

    return rpexp_write_hw_mask(_reg(uart_addr[uart]->cr),
        (bool_to_bit(cts) << UART_UARTCR_CTSEN_LSB) | (bool_to_bit(rts) << UART_UARTCR_RTSEN_LSB),
        UART_UARTCR_RTSEN_BITS | UART_UARTCR_CTSEN_BITS);
}


static rpexp_err_t uart_check_fr_bit_action(uart_chan_t uart, uint32_t bit_mask_to_check, bool *actionable) {

    if (!actionable) {
        return RPEXP_ERR_API_ARG;
    }

    if (uart >= NUM_UART) {
        return RPEXP_ERR_API_ARG;
    }

    uint32_t uart_fr;
    rpexp_err_t rpexp_err = rpexp_read32(_reg(uart_addr[uart]->fr), &uart_fr);

    if (rpexp_err == RPEXP_OK) {
        if (uart_fr & bit_mask_to_check) {
            *actionable = false;
        } else {
            *actionable = true;
        }
    }

    return rpexp_err;
}


static rpexp_err_t uart_read_rxed_data(uart_chan_t uart, int *prxd) {

    uint32_t read_dr;

    rpexp_err_t rpexp_err = rpexp_read32(_reg(uart_addr[uart]->dr), &read_dr);

    if (rpexp_err == RPEXP_OK) {
        *prxd = (int) (read_dr & 0x0FFul);
    }

    return rpexp_err;
}

#define REBOOT_TIMEOUT 1

static rpexp_err_t run_rpexp_program(uint32_t pc, uint32_t sp) {

    rpexp_err_t rpexp_err;

