raspberrypi/rp2040-expander/host/rp2040exp.c
    pc |= 1ul;  // Ensure it is in Thumb mode!

    if (rpexp_err == RPEXP_OK) {
        // Clear enable before setting up scratch registers
        rpexp_err = rpexp_hw_clear_bits(_reg(watchdog_hw->ctrl), WATCHDOG_CTRL_ENABLE_BITS);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(watchdog_hw->scratch[4]), 0xb007c0d3);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(watchdog_hw->scratch[5]), pc ^ -0xb007c0d3);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(watchdog_hw->scratch[6]), sp);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(watchdog_hw->scratch[7]), pc);
    }

#ifdef REBOOT_TIMEOUT
    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(watchdog_hw->load), 50000);
    }
#endif

    if (rpexp_err == RPEXP_OK) {
        // Reset everything apart from ROSC and XOSC
        rpexp_err = rpexp_hw_set_bits(_reg(psm_hw->wdsel), PSM_WDSEL_BITS & ~(PSM_WDSEL_ROSC_BITS | PSM_WDSEL_XOSC_BITS));
      //rpexp_err = rpexp_hw_set_bits(_reg(psm_hw->wdsel), 0);
    }

    // Do not pause on restart for debug
    uint32_t dbg_bits = WATCHDOG_CTRL_PAUSE_DBG0_BITS |
                        WATCHDOG_CTRL_PAUSE_DBG1_BITS |
                        WATCHDOG_CTRL_PAUSE_JTAG_BITS;

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_hw_clear_bits(_reg(watchdog_hw->ctrl), dbg_bits);
    }

#ifdef REBOOT_TIMEOUT
    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_hw_set_bits(_reg(watchdog_hw->ctrl), WATCHDOG_CTRL_ENABLE_BITS);
    }
#else
    if (rpexp_err == RPEXP_OK) {
      rpexp_err = rpexp_hw_set_bits(_reg(watchdog_hw->ctrl), WATCHDOG_CTRL_TRIGGER_BITS);
    }
#endif

    return rpexp_err;
}

//----------------------------------------------------------------------------

// Public API

rpexp_err_t rpexp_init(void) {

    rpexp_err_t rpexp_err;

    rpexp_err = dap_if_init();

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = chip_init();
    }

    return rpexp_err;
}

//----------------------------------------------------------------------------

rpexp_err_t rpexp_gpio_block_enable(bool enable) {

    return peripheral_enable(enable, RESETS_RESET_PADS_BANK0_BITS | RESETS_RESET_IO_BANK0_BITS);
}


rpexp_err_t rpexp_gpio_init(uint32_t gpio) {

    uint32_t mask = 1ul << gpio;
    rpexp_err_t rpexp_err = rpexp_hw_clear_bits(_reg(sio_hw->gpio_out), mask);

    // set as output
    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_gpio_set_dir_out_masked(mask);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = set_gpio_function(gpio, GPIO_FUNC_SIO);
    }

    return rpexp_err;
}


rpexp_err_t rpexp_gpio_init_mask(uint32_t mask) {

    rpexp_err_t rpexp_err = RPEXP_OK;

    for (uint32_t bit = 0; bit < NUM_BANK0_GPIOS && rpexp_err == RPEXP_OK; bit++) {

        if (mask & (1ul << bit)) {
            rpexp_err = rpexp_gpio_init(bit);
        }
    }

    return rpexp_err;
}


rpexp_err_t rpexp_gpio_deinit(uint32_t gpio) {
    return set_gpio_function(gpio, GPIO_FUNC_NULL);
}


rpexp_err_t rpexp_gpio_deinit_mask(uint32_t mask) {

    rpexp_err_t rpexp_err = RPEXP_OK;

    for (uint32_t bit = 0; bit < NUM_BANK0_GPIOS && rpexp_err == RPEXP_OK; bit++) {

        if (mask & (1ul << bit)) {
            rpexp_err = rpexp_gpio_deinit(bit);
        }
    }

    return rpexp_err;
}


rpexp_err_t rpexp_gpio_set_dir(uint32_t gpio, gpio_dir_t gpio_dir) {

    uint32_t mask = 1ul << gpio;

    if (gpio_dir == GPIO_DIR_IN) {
        return rpexp_gpio_set_dir_in_masked(mask);
    } else {
        return rpexp_gpio_set_dir_out_masked(mask);
    }
}


rpexp_err_t rpexp_gpio_set_dir_out_masked(uint32_t mask) {
    return rpexp_write32(_reg(sio_hw->gpio_oe_set), mask);
}


rpexp_err_t rpexp_gpio_set_dir_in_masked(uint32_t mask) {
    return rpexp_write32(_reg(sio_hw->gpio_oe_clr), mask);
}


rpexp_err_t rpexp_gpio_set_mask(uint32_t mask) {
    return rpexp_write32(_reg(sio_hw->gpio_set), mask);
}


rpexp_err_t rpexp_gpio_clr_mask(uint32_t mask) {
    return rpexp_write32(_reg(sio_hw->gpio_clr), mask);
}


rpexp_err_t rpexp_gpio_toggle_mask(uint32_t mask) {
    return rpexp_write32(_reg(sio_hw->gpio_togl), mask);
}


rpexp_err_t rpexp_gpio_set(uint32_t gpio) {
    return rpexp_gpio_set_mask(1ul << gpio);
}


rpexp_err_t rpexp_gpio_clr(uint32_t gpio) {
    return rpexp_gpio_clr_mask(1ul << gpio);
}


rpexp_err_t rpexp_gpio_toggle(uint32_t gpio) {
    return rpexp_gpio_toggle_mask(1ul << gpio);
}


uint32_t rpexp_gpio_get_all(void) {

    uint32_t read_value;

    if (RPEXP_OK != rpexp_read32(_reg(sio_hw->gpio_in), &read_value)) {
        return 0xFFFFFFFFul;
    }

    return read_value;
}


rpexp_err_t rpexp_gpio_set_all(uint32_t mask) {
    return rpexp_write32(_reg(sio_hw->gpio_out), mask);
}


rpexp_err_t rpexp_clock_gpio_init(uint32_t gpio, rpexp_clkout_t clk_src, float div)
{
    uint32_t div_int = (uint32_t)div;
    uint8_t frac = (uint8_t)((div - (float)div_int) * (1u << CLOCKS_CLK_GPOUT0_DIV_INT_LSB));
    return _clock_gpio_init_int_frac(gpio, clk_src, div_int, frac);
}


// Simple clock init code, with some parameters to set up the PLL (etc.)
rpexp_err_t rpexp_set_rosc(void) {
    return RPEXP_ERR_UNSUPPORTED;
}

rpexp_err_t rpexp_set_xosc(void) {
    return RPEXP_ERR_UNSUPPORTED;
}

//----------------------------------------------------------------------------

rpexp_err_t rpexp_read32(uint32_t address, uint32_t *pdata) {

    if (!pdata) {
        return RPEXP_ERR_API_ARG;
    }

    uint32_t dummy;
    rpexp_err_t rpexp_err = dap_set_target_rd_wr_address(address, NO_AUTO_INC);  // set address, inc mode

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = dap_read(AP_REG_IDR, &dummy);    // read dummy word
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = dap_read(DP_REG_RDBUF, pdata);     // read actual data
    }

    return rpexp_err;
}


rpexp_err_t rpexp_write32(uint32_t address, uint32_t data) {

    uint32_t dummy;
    rpexp_err_t rpexp_err = dap_set_target_rd_wr_address(address, NO_AUTO_INC);  // set address, inc mode

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = dap_write(AP_REG_IDR, data);     // write desired data
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = dap_read(DP_REG_RDBUF, &dummy);    // dummy READ to flush the WRITE!!
    }

    return rpexp_err;
}

//----------------------------------------------------------------------------

rpexp_err_t rpexp_block_read32(uint32_t address, uint32_t *pdata, uint32_t length) {

    if (!pdata) {
        return RPEXP_ERR_API_ARG;
    }

