raspberrypi/rp2040-expander/host/rp2040exp.c
    uint32_t dummy;
    rpexp_err_t rpexp_err = RPEXP_OK;

    while (rpexp_err == RPEXP_OK && length) {
        uint32_t xfer_length;

        if (length > DAP_BLOCK_XFER_MAX_WORD_LENGTH) {
             xfer_length = DAP_BLOCK_XFER_MAX_WORD_LENGTH;
        } else {
            xfer_length = length;
        }

        rpexp_err = dap_set_target_rd_wr_address(address, USE_AUTO_INC);

        address += (xfer_length * 4);
        length -= xfer_length;

        if (rpexp_err == RPEXP_OK) {
            rpexp_err = dap_read(AP_REG_IDR, &dummy);    // read dummy word
        }

        while (rpexp_err == RPEXP_OK && xfer_length--) {
            rpexp_err = dap_read(AP_REG_DRW, pdata++);     // read actual data
        }
    }

    return rpexp_err;
}


rpexp_err_t rpexp_block_write32(uint32_t address, const uint32_t *pdata, uint32_t length) {

    if (!pdata) {
        return RPEXP_ERR_API_ARG;
    }

    uint32_t dummy = 0;
    rpexp_err_t rpexp_err = RPEXP_OK;

    while (rpexp_err == RPEXP_OK && length) {
        uint32_t xfer_length;

        if (length > DAP_BLOCK_XFER_MAX_WORD_LENGTH) {
             xfer_length = DAP_BLOCK_XFER_MAX_WORD_LENGTH;
        } else {
            xfer_length = length;
        }

        rpexp_err = dap_set_target_rd_wr_address(address, USE_AUTO_INC);

        address += (xfer_length * 4);
        length -= xfer_length;

        while (rpexp_err == RPEXP_OK && xfer_length--) {
            rpexp_err = dap_write(AP_REG_DRW, *pdata++);
        }

        if (rpexp_err == RPEXP_OK) {
            rpexp_err = dap_read(DP_REG_RDBUF, &dummy);  // dummy READ to flush the WRITE!!
        }
    }

    return rpexp_err;
}

//----------------------------------------------------------------------------

// Note:  To 'speed things up' we could use inlining, remove some checking etc.
// but it won't make much difference.  The time consuming part is doing the DAP
// transactions which the use of these helpers reduces to a minimum already.

rpexp_err_t rpexp_write_hw_mask(uint32_t addr, uint32_t values, uint32_t write_mask) {

    if (addr < SYSINFO_BASE /*|| addr >= DMA_BASE*/) {
        return RPEXP_ERR_API_ARG;
    }

    uint32_t temp;
    rpexp_err_t rpexp_err = rpexp_read32(addr, &temp);

    if (rpexp_err == RPEXP_OK) {
        temp &= ~write_mask;
        temp |= (write_mask & values);

        rpexp_err = rpexp_write32(addr, temp);
    }

    return rpexp_err;
}


rpexp_err_t rpexp_hw_set_bits(uint32_t addr, uint32_t mask) {

    if (addr < SYSINFO_BASE /*|| addr >= DMA_BASE*/) {
        return RPEXP_ERR_API_ARG;
    }

    return rpexp_write32(REG_ALIAS_SET_BITS | addr, mask);
}


rpexp_err_t rpexp_hw_clear_bits(uint32_t addr, uint32_t mask) {

    if (addr < SYSINFO_BASE /*|| addr >= DMA_BASE*/) {
        return RPEXP_ERR_API_ARG;
    }

    return rpexp_write32(REG_ALIAS_CLR_BITS | addr, mask);
}


rpexp_err_t rpexp_hw_xor_bits(uint32_t addr, uint32_t mask) {

    if (addr < SYSINFO_BASE /*|| addr >= DMA_BASE*/) {
        return RPEXP_ERR_API_ARG;
    }

    return rpexp_write32(REG_ALIAS_XOR_BITS | addr, mask);
}

//----------------------------------------------------------------------------

rpexp_err_t rpexp_gpio_hi_block_enable(bool enable) {

    return peripheral_enable(enable, RESETS_RESET_PADS_QSPI_BITS | RESETS_RESET_IO_QSPI_BITS);
}


rpexp_err_t rpexp_gpio_hi_init(uint32_t higpio) {

    if (higpio >= NUM_QSPI_GPIOS) {
        return RPEXP_ERR_API_ARG;
    }

    uint32_t himask = 1ul << higpio;
    rpexp_err_t rpexp_err = rpexp_hw_clear_bits(_reg(sio_hw->gpio_hi_out), himask);

    // set as output
    if (rpexp_err == RPEXP_OK) {
        rpexp_err =  rpexp_gpio_hi_set_dir_out_masked(himask);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = set_gpio_hi_function(higpio, GPIO_FUNC_SIO);
    }

    return rpexp_err;
}


rpexp_err_t rpexp_gpio_hi_init_mask(uint32_t himask) {

    rpexp_err_t rpexp_err = RPEXP_OK;

    for (uint32_t bit = 0; bit < NUM_BANK0_GPIOS && rpexp_err == RPEXP_OK; bit++) {

        if (himask & (1ul << bit)) {
            rpexp_err =  rpexp_gpio_hi_init(bit);
        }
    }

    return rpexp_err;
}


rpexp_err_t rpexp_gpio_hi_deinit(uint32_t higpio) {

    return set_gpio_hi_function(higpio, GPIO_FUNC_NULL);
}


rpexp_err_t rpexp_gpio_hi_deinit_mask(uint32_t higpio_mask) {

    rpexp_err_t rpexp_err = RPEXP_OK;

    for (uint32_t bit = 0; bit < NUM_QSPI_GPIOS && rpexp_err == RPEXP_OK; bit++) {

        if (higpio_mask & (1ul << bit)) {
            rpexp_err =  rpexp_gpio_hi_deinit(bit);
        }
    }

    return rpexp_err;
}


rpexp_err_t rpexp_gpio_hi_set_dir(uint32_t higpio, gpio_dir_t gpio_dir) {

    if (higpio >= NUM_QSPI_GPIOS) {
        return RPEXP_ERR_API_ARG;
    }

    uint32_t himask = 1ul << higpio;

    if (gpio_dir == GPIO_DIR_IN) {
        return  rpexp_gpio_hi_set_dir_in_masked(himask);
    } else {
        return  rpexp_gpio_hi_set_dir_out_masked(himask);
    }
}


rpexp_err_t rpexp_gpio_hi_set_dir_out_masked(uint32_t himask) {
    return rpexp_write32(_reg(sio_hw->gpio_hi_oe_set), himask);
}


rpexp_err_t rpexp_gpio_hi_set_dir_in_masked(uint32_t himask) {
    return rpexp_write32(_reg(sio_hw->gpio_hi_oe_clr), himask);
}


rpexp_err_t rpexp_gpio_hi_set_mask(uint32_t himask) {
    return rpexp_write32(_reg(sio_hw->gpio_hi_set), himask);
}


rpexp_err_t rpexp_gpio_hi_clr_mask(uint32_t himask) {
    return rpexp_write32(_reg(sio_hw->gpio_hi_clr), himask);
}


rpexp_err_t rpexp_gpio_hi_toggle_mask(uint32_t himask) {
    return rpexp_write32(_reg(sio_hw->gpio_hi_togl), himask);
}


uint32_t rpexp_gpio_hi_get_all(void) {

    uint32_t hiread_value;

    if (RPEXP_OK != rpexp_read32(_reg(sio_hw->gpio_hi_in), &hiread_value)) {
        return 0xFFFFFFFFul;
    }

    return hiread_value;
}


rpexp_err_t rpexp_gpio_hi_set_all(uint32_t himask) {
    return rpexp_write32(_reg(sio_hw->gpio_hi_out), himask);
}


rpexp_err_t rpexp_gpio_set_pulls(uint32_t gpio, bool up, bool down) {

    return rpexp_write_hw_mask(_reg(padsbank0_hw->io[gpio]),
        (bool_to_bit(up) << PADS_BANK0_GPIO0_PUE_LSB) | (bool_to_bit(down) << PADS_BANK0_GPIO0_PDE_LSB),
        PADS_BANK0_GPIO0_PUE_BITS | PADS_BANK0_GPIO0_PDE_BITS);
}

//----------------------------------------------------------------------------

rpexp_err_t rpexp_adc_block_enable(bool enable) {

