raspberrypi/rp2040-expander/host/rp2040exp.c
    rpexp_err_t rpexp_err = adc_clock_init(enable);

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = peripheral_enable(enable, RESETS_RESET_ADC_BITS);
    }

    return rpexp_err;
}


rpexp_err_t rpexp_adc_init(void) {

    rpexp_err_t rpexp_err = rpexp_adc_block_enable(false);

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_adc_block_enable(true);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write32(_reg(adc_hw->cs),  ADC_CS_EN_BITS);
    }

    for (uint32_t escape = 0; rpexp_err == RPEXP_OK; escape++) {

        uint32_t adc_hw_cs;

        rpexp_err = rpexp_read32(_reg(adc_hw->cs), &adc_hw_cs);

        if (rpexp_err == RPEXP_OK && (adc_hw_cs & ADC_CS_READY_BITS)) {
            break;
        }

        if (escape > ADC_ESCAPE_COUNT) {
           rpexp_err = RPEXP_ERR_ADC_TIMEOUT;
        }
    }

    return rpexp_err;
}


rpexp_err_t rpexp_adc_gpio_init(uint32_t gpio) {

    if ((gpio >= NUM_BANK0_GPIOS) ||
        (gpio <= (NUM_BANK0_GPIOS - NUM_ADC_CHANNELS))) {
        return RPEXP_ERR_API_ARG;
    }

    // Select NULL function to make output driver hi-Z
    rpexp_err_t rpexp_err = set_gpio_function(gpio, GPIO_FUNC_NULL);

    // Disable digital pulls and digital receiver
    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_disable_gpio_pulls(gpio);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = set_gpio_input_enabled(gpio, 0);
    }

    return rpexp_err;
}


rpexp_err_t rpexp_adc_select_input(uint32_t channel) {

    if (channel >= NUM_ADC_CHANNELS) {
        return RPEXP_ERR_API_ARG;
    }

    return rpexp_write_hw_mask(_reg(adc_hw->cs), channel << ADC_CS_AINSEL_LSB, ADC_CS_AINSEL_BITS);
}


rpexp_err_t rpexp_adc_get_selected_input(uint32_t *pinput) {

    if (!pinput) {
        return RPEXP_ERR_API_ARG;
    }

    rpexp_err_t rpexp_err = rpexp_read32(_reg(adc_hw->cs), pinput);

    *pinput  &= ADC_CS_AINSEL_BITS;
    *pinput >>= ADC_CS_AINSEL_LSB;

    if (rpexp_err != RPEXP_OK) {
        *pinput = 0;
    }

    return rpexp_err;
}


rpexp_err_t rpexp_adc_set_temp_sensor_enabled(bool enable) {

    if (enable) {
        return rpexp_hw_set_bits(_reg(adc_hw->cs), ADC_CS_TS_EN_BITS);
    } else {
        return rpexp_hw_clear_bits(_reg(adc_hw->cs), ADC_CS_TS_EN_BITS);
    }
}


rpexp_err_t rpexp_adc_read(uint32_t *padcreading) {

    uint32_t escape;

    if (!padcreading) {
        return RPEXP_ERR_API_ARG;
    }

    rpexp_err_t rpexp_err = rpexp_hw_set_bits(_reg(adc_hw->cs), ADC_CS_START_ONCE_BITS);

    for (escape = 0; escape <= ADC_ESCAPE_COUNT && rpexp_err == RPEXP_OK; escape++) {

        rpexp_err = rpexp_read32(_reg(adc_hw->cs), padcreading);

        if (rpexp_err == RPEXP_OK && (*padcreading & ADC_CS_READY_BITS)) {

            rpexp_err = rpexp_read32(_reg(adc_hw->result), padcreading);
            break;
        }
    }

    if (escape > ADC_ESCAPE_COUNT) {
        rpexp_err = RPEXP_ERR_ADC_TIMEOUT;
    }

    if (rpexp_err != RPEXP_OK) {
        *padcreading = 0ul;  // overwrite failed reads
    }

    return rpexp_err;
}


rpexp_err_t rpexp_time_get_ticks32(uint32_t *pticks) {

    if (!pticks) {
        return RPEXP_ERR_API_ARG;
    }

    return rpexp_read32(_reg(timer_hw->timerawl), pticks);
}


rpexp_err_t rpexp_time_get_ticks64(uint64_t *pticks) {

    if (!pticks) {
        return RPEXP_ERR_API_ARG;
    }

    uint32_t lo, hi;

    // Reading low latches the high value
    rpexp_err_t rpexp_err = rpexp_read32(_reg(timer_hw->timelr), &lo);

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_read32(_reg(timer_hw->timehr), &hi);
    }

    if (rpexp_err == RPEXP_OK) {
        *pticks = ((uint64_t) hi << 32u) | lo;
    }

    return rpexp_err;
}


rpexp_err_t rpexp_rosc_set_div(uint32_t rosc_div) {

    if (rosc_div == 0 || rosc_div > 32) {
        return RPEXP_ERR_API_ARG;
    }

    if (rosc_div == 32) {
        rosc_div = 0;
    }

    rpexp_err_t rpexp_err = rpexp_write32(_reg(rosc_hw->div), (rosc_div + ROSC_DIV_VALUE_PASS));

    if (rpexp_err == RPEXP_OK) {
        // REstart timing for ROSC frequency measurement
        rpexp_err = get_timespec_and_tickcount(&snapshot_rosc_time_n_count);
    }
}


rpexp_err_t rpexp_rosc_get_div(uint32_t *pdiv) {

    rpexp_err_t rpexp_err = rpexp_read32(_reg(rosc_hw->div), pdiv);

    if (rpexp_err == RPEXP_OK) {

        *pdiv -= ROSC_DIV_VALUE_PASS;
        if (*pdiv == 0) {
            *pdiv = 32;
        }
    }
    else {
        *pdiv = 0;
    }

    return rpexp_err;
}


rpexp_err_t rpexp_rosc_get_freq_ab_bits(uint32_t *pfreq_bits32) {

    uint32_t freqa, freqb;

    if (!pfreq_bits32) {
        return RPEXP_ERR_API_ARG;
    }

    rpexp_err_t rpexp_err = rpexp_read32(_reg(rosc_hw->freqa), &freqa);

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_read32(_reg(rosc_hw->freqb), &freqb);
    }

    if (rpexp_err == RPEXP_OK) {
        *pfreq_bits32 = ((freqb << 16)  | (freqa & 0xfffful));
    }

    return rpexp_err;
}


rpexp_err_t rpexp_rosc_set_freq_ab_bits(uint32_t freq_bits32) {

    rpexp_err_t rpexp_err = common_rosc_set_freq_ab_bits(freq_bits32);

    if (rpexp_err == RPEXP_OK) {
        // REstart timing for ROSC frequency measurement
        rpexp_err = get_timespec_and_tickcount(&snapshot_rosc_time_n_count);
    }

    return RPEXP_OK;
}


rpexp_err_t rpexp_rosc_zero_all_freq_ab_bits(void) {

    uint32_t freq_bits, starting_freq_bits;

    rpexp_err_t rpexp_err = rpexp_rosc_get_freq_ab_bits(&freq_bits);

    starting_freq_bits = freq_bits;

    // zero the freq a/b bits, one bit at a time to avoid glitches
    while (rpexp_err == RPEXP_OK && freq_bits) {
        freq_bits = rpexp_rosc_dec_freq_ab_bits(freq_bits);
        rpexp_err = common_rosc_set_freq_ab_bits(freq_bits);
    }

    if (rpexp_err == RPEXP_OK && freq_bits != starting_freq_bits) {
        // REstart timing for ROSC frequency measurement
        rpexp_err = get_timespec_and_tickcount(&snapshot_rosc_time_n_count);
    }

    return rpexp_err;
}


uint32_t rpexp_rosc_inc_freq_ab_bits(uint32_t freq32) {

    // Note:  We set bits working *down* from the MS side since, with shorter
    // ROSC chain lengths (MEDIUM, HIGH) the LS sections are the ones removed.
    for (unsigned int bit = 30; bit >= 0; bit--) {

        if ((bit % 4) == 3) {
            continue;  // there are no active bits at positions 3, 7, 11 ... 31
        }

