raspberrypi/rp2040-expander/host/rp2040exp.c
        uint32_t bit_mask = 1ul << bit;

        if (freq32 & bit_mask) {
            continue; // already set
        }

        freq32 |= bit_mask;  // set it!!
        break;
    }

    return freq32;
}


uint32_t rpexp_rosc_dec_freq_ab_bits(uint32_t freq32) {

    // Work up, LS->MS, see comment in: rpexp_rosc_inc_freq_ab_bits()
    for (unsigned int bit = 0; bit < 31; bit++) {

        if ((bit % 4) == 3) {
            continue;  // there are no active bits at positions 3, 7, 11 ... 31
        }

        uint32_t bit_mask = 1ul << bit;

        if (0 == (freq32 & bit_mask)) {
            continue; // already clear
        }

        freq32 &= ~bit_mask;  // clear it!!
        break;
    }

    return freq32;
}


rpexp_err_t rpexp_rosc_measure_clock_freq_khz(uint32_t *rosc_freq_khz, uint32_t min_sample_us) {

    rpexp_err_t rpexp_err;
    uint64_t delta_time_us;
    rosc_time_n_count_t current_rosc_time_n_count;

    *rosc_freq_khz = 0;

    do {
        rpexp_err = get_timespec_and_tickcount(&current_rosc_time_n_count);

        if (rpexp_err != RPEXP_OK) {
            break;
        }

        delta_time_us = current_rosc_time_n_count.time_us - snapshot_rosc_time_n_count.time_us;

        if (delta_time_us > (uint64_t) min_sample_us) {
            break;
        }

        rpexp_tight_loop_contents();

    } while (min_sample_us);

    if (rpexp_err == RPEXP_OK) {

        uint64_t delta_tick_count = current_rosc_time_n_count.tick_count - snapshot_rosc_time_n_count.tick_count;
        *rosc_freq_khz = (uint32_t) ((delta_tick_count * (uint64_t) 1000ull * (uint64_t) TICK_GENERATOR_CYCLES) / delta_time_us);

        // update the static datapoint for (any) subsequent calculation(s)
        snapshot_rosc_time_n_count = current_rosc_time_n_count;

        /// record system frequency for subsequent baudrate setting etc.
        system_clock_frequency_khz = *rosc_freq_khz;

    }

    return rpexp_err;
}


rpexp_err_t rpexp_rosc_set_faster_clock_freq(uint32_t target_rosc_clock_khz, uint32_t *measured_rosc_clock_khz) {

    uint32_t rosc_div;
    uint32_t rosc_freq_khz;
    uint32_t new_rosc_freq_khz;

    // Firstly, trim ROSC fully _down_ in frequency
    rpexp_err_t rpexp_err = rpexp_rosc_zero_all_freq_ab_bits();

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_rosc_measure_clock_freq_khz(measured_rosc_clock_khz, MIN_ROSC_FREQ_SAMPLE_TIME_US);
    }

    if (rpexp_err == RPEXP_OK && (target_rosc_clock_khz < *measured_rosc_clock_khz)) {
        // it is not possible to slow things down further because the diver setting
        // can not be increased without [possibly] glitching the ROSC clock.
        // Return "OK" and leave the *caller* to decide if this is slow enough ...
        return RPEXP_OK;
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_rosc_get_div(&rosc_div);
    }

    if (rpexp_err == RPEXP_OK) {

        uint32_t new_div;

        for (new_div = rosc_div; new_div > 1; new_div--) {

            new_rosc_freq_khz = target_rosc_clock_khz * new_div;

            // this could be smarter for low target freqs, e.g. 10 MHz, to allow "centreing"
            // the freq a/b but settings to more easily allow for trimming but it will [still]
            // work optimally for higher target frquencies, such as 48 MHz, where there
            // is likely only one possible divider ratio setting anyway.
            if (new_rosc_freq_khz <= ROSC_MAX_FREQ_KHZ) {
                break;
            }
        }

        rpexp_err = rpexp_rosc_set_div(new_div);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rosc_frequency_trim_up(target_rosc_clock_khz, measured_rosc_clock_khz);
    }

    return rpexp_err;
}

//----------------------------------------------------------------------------

rpexp_err_t rpexp_load_and_run_ram_program(const uint32_t *pobject, uint32_t length) {

    rpexp_err_t rpexp_err = rpexp_block_write32(SRAM_BASE, pobject, length);

    // hard code for now ...
    uint32_t pc = 0x20000001ul;
    uint32_t sp = 0x20042000ul;

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = run_rpexp_program(pc, sp);
    }

    return rpexp_err;
}

//----------------------------------------------------------------------------

rpexp_err_t rpexp_uart_enable(uart_chan_t uart, bool enable) {

    if (uart >= NUM_UART) {
        return RPEXP_ERR_API_ARG;
    }

    rpexp_err_t rpexp_err = peripheral_clock_init(enable);

    if (rpexp_err == RPEXP_OK) {
        if (uart == UART0) {
            return peripheral_enable(enable, RESETS_RESET_UART0_BITS);
        } else {
            return peripheral_enable(enable, RESETS_RESET_UART1_BITS);
        }
    }
}


rpexp_err_t rpexp_uart_init(uart_chan_t uart,
                            uint32_t baudrate,
                            uint32_t data_bits,
                            uint32_t stop_bits,
                            uart_parity_type_t parity,
                            bool cts, bool rts) {

    uint32_t acual_baudrate;

    rpexp_err_t rpexp_err = uart_set_baudrate(uart, baudrate, &acual_baudrate);

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = uart_set_format(uart, data_bits, stop_bits, parity);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = uart_set_hw_flow(uart, cts, rts);
    }

    if (rpexp_err == RPEXP_OK) {
        rpexp_err = rpexp_write_hw_mask(_reg(uart_addr[uart]->cr),
            UART_UARTCR_UARTEN_BITS | UART_UARTCR_TXE_BITS | UART_UARTCR_RXE_BITS,
            UART_UARTCR_UARTEN_BITS | UART_UARTCR_TXE_BITS | UART_UARTCR_RXE_BITS);
    }

    if (rpexp_err == RPEXP_OK) {
        // Always enable DREQ signals -- no harm in this if DMA is not listening
        rpexp_err = rpexp_write32(_reg(uart_addr[uart]->dmacr), UART_UARTDMACR_TXDMAE_BITS | UART_UARTDMACR_RXDMAE_BITS);
    }

    return rpexp_err;
}


rpexp_err_t rpexp_uart_assign_gpios(const int8_t *pgpio_list) {

    if (!pgpio_list) {
        return RPEXP_ERR_API_ARG;
    }

    rpexp_err_t rpexp_err = RPEXP_OK;

    do {
        int8_t gpio_num = *pgpio_list++;

        if (gpio_num < 0) {
            break;
        }

        uint32_t gpio = (uint32_t) gpio_num;

        rpexp_err = set_gpio_function(gpio, GPIO_FUNC_UART);

    } while (rpexp_err == RPEXP_OK);

    return rpexp_err;
}


rpexp_err_t rpexp_uart_deinit(uart_chan_t uart) {

