raspberrypi/rp2040-expander/host/rp2040exp.c
}


rpexp_err_t rpexp_uart_is_readable(uart_chan_t uart, bool *readable) {

    // PL011 doesn't expose levels directly, so return values are only true and false
    return uart_check_fr_bit_action(uart, UART_UARTFR_RXFE_BITS, readable);
}


rpexp_err_t rpexp_uart_getc(uart_chan_t uart, int *prxd) {

    if (!prxd) {
        return RPEXP_ERR_API_ARG;
    }

    bool readable;
    rpexp_err_t rpexp_err;

    do {
        rpexp_err = rpexp_uart_is_readable(uart, &readable);
        rpexp_tight_loop_contents();
    } while (!readable && rpexp_err == RPEXP_OK);

    if (rpexp_err == RPEXP_OK) {
        return uart_read_rxed_data(uart, prxd);
    }
    else {
        *prxd = -1;
    }

    return rpexp_err;
}


rpexp_err_t rpexp_uart_getc_non_blocking(uart_chan_t uart, int *prxd) {

    if (!prxd) {
        return RPEXP_ERR_API_ARG;
    }

    bool readable;
    rpexp_err_t rpexp_err = rpexp_uart_is_readable(uart, &readable);

    if (rpexp_err == RPEXP_OK && readable) {
        return uart_read_rxed_data(uart, prxd);
    }
    else {
        *prxd = -1;
    }

    return rpexp_err;
}


rpexp_err_t rpexp_uart_read_blocking(uart_chan_t uart, uint8_t *dst, uint32_t len) {

    if (!dst) {
        return RPEXP_ERR_API_ARG;
    }

    if (uart >= NUM_UART) {
        return RPEXP_ERR_API_ARG;
    }

    rpexp_err_t rpexp_err = RPEXP_OK;

    for (uint32_t i = 0; i < len && rpexp_err == RPEXP_OK; ++i) {
        int data;
        rpexp_err = rpexp_uart_getc(uart, &data);
        *dst++ = (uint8_t) (data & 0x0FFul);
    }

    return rpexp_err;
}


rpexp_err_t rpexp_uart_is_writable(uart_chan_t uart, bool *writeable) {

    return uart_check_fr_bit_action(uart, UART_UARTFR_TXFF_BITS, writeable);
}


rpexp_err_t rpexp_uart_putc(uart_chan_t uart, char c) {

    return rpexp_uart_write_blocking(uart, (const uint8_t *) &c, 1);
}


rpexp_err_t rpexp_uart_puts(uart_chan_t uart, const char *s) {

    rpexp_err_t rpexp_err = RPEXP_OK;

    do {
        char c = *s++;

        if (!c) {
            break;
        }

        rpexp_err = rpexp_uart_putc(uart, c);

    } while (rpexp_err == RPEXP_OK);

    return rpexp_err;
}


rpexp_err_t rpexp_uart_write_blocking(uart_chan_t uart, const uint8_t *src, uint32_t len) {

    if (!src) {
        return RPEXP_ERR_API_ARG;
    }

    if (uart >= NUM_UART) {
        return RPEXP_ERR_API_ARG;
    }

    rpexp_err_t rpexp_err = RPEXP_OK;

    for (uint32_t i = 0; i < len && rpexp_err == RPEXP_OK; ++i) {

        bool writeable;

        do {
            rpexp_err = rpexp_uart_is_writable(uart, &writeable);
            rpexp_tight_loop_contents();
        } while (!writeable && rpexp_err == RPEXP_OK);

        if (rpexp_err == RPEXP_OK) {
            rpexp_err = rpexp_write32(_reg(uart_addr[uart]->dr), (uint32_t) *src++);
        }
    }

    return rpexp_err;
}


rpexp_err_t rpexp_uart_set_break(uart_chan_t uart, bool en) {

}
